export default function PersonalityPage(){
    return(
         <div className="MainPage">
            <div className='MainPage__container'>
                 <h1 className='text textCenter'>🧬Расшифровка личности</h1>

                 <div className="page-container">
            {/* Вступление */}
            <div className="section">
                <h2 className="text-accent">Вы знаете себя настоящих? 🧬</h2>
                <p className="text3">Или живёте так, как от Вас ждут другие?</p>
                <p className="text3">В каждом из нас скрыто больше талантов и уникальных способностей, чем кажется — стоит только заглянуть вглубь. ✨</p>
            </div>

            {/* Блок проблем */}
            <div className="section">
                <h3 className="text-accent">Очень часто мы живём чужими сценариями: 🎭</h3>
                <p className="text3">— пытаемся соответствовать ожиданиям семьи и общества;</p>
                <p className="text3">— боимся проявить характер;</p>
                <p className="text3">— чувствуем, что теряем себя, но не знаем, где искать ответы.</p>
            </div>

            

            {/* Вопросы */}
            <div className="section">
                <h3 className="text-accent">Вечные вопросы: ❓</h3>
                <p className="text3">— «Я не знаю, в чём моя сила»</p>
                <p className="text3">— «Все вокруг талантливые, а я будто ничем не выделяюсь»</p>
                <p className="text3">— «Многое уже попробовано, но я всё ещё не понимаю, где моё место»</p>
            </div>


            {/* Разбор и результат */}
            <div className="section">
                <h3 className="text-accent">Результат для Вас 🧩</h3>
                <p className="text3">После консультации появится ощущение, что Вы собрали «пазл про себя» — и увидели, какие дары уже есть внутри.</p>
                <p className="text3">Я бережно разберу Ваш природный характер:</p>
                <p className="text3">• раскрою сильные и уязвимые стороны;</p>
                <p className="text3">• определю таланты, важные для работы и отношений;</p>
                <p className="text3">• подскажу, какие способности развивать сейчас. 🚀</p>
            </div>

            {/* Техническая часть */}
            <div className="footer-section">
                <p className="text-accent">Формат: 🎙️</p>
                <p className="text3">• Аудио-разбор;</p>
                <p className="text3">• Запись остаётся у Вас навсегда + подсказки.</p>
                
                <div className="price-block">
                    <p className="text-accent">Стоимость: 150 € 💶</p>
                    <p className="text3">Необходимо: дата рождения 📅</p>
                </div>
                
                <button className="order-button">Заказать 💳</button>
            </div>
        </div>              
            </div>
        </div>
    )
}